"Aggressive Samba search" = "Aggressiviivinen Samba-haku";
"All..." = "Kaikki...";
"Appearance" = "Ulkoasu";
"Camera" = "Kamera";
"Clear Samba server cache" = "Tyhjennä Samba-palvelinvälimuisti";
"Crop" = "Rajaa";
"DEVICES" = "LAITTEET";
"FAVORITES" = "SUOSIKIT";
"Flip" = "Käännä";
"Icon Size" = "Kuvakekoko";
"Image Editor" = "Kuvamuokkain";
"Info" = "Tiedot";
"Launch..." = "Käynnistä...";
"PLACES" = "PAIKAT";
"RECENT DOCUMENTS" = "TIEDOSTOHISTORIA";
"Recent Documents" = "Äskeiset dokumentit";
"Refresh Samba server list every:" = "Samba-palvelinten listan päivitystiheys:";
"Repository" = "Säilytyspaikka";
"Rotation" = "Pyöritä";
"SEARCH FOR" = "ETSI";
"SHARED" = "JAETTU";
"Shared" = "Jaettu";
"Tool" = "Työkalu";
"Zoom" = "Muuta kokoa";
"add" = "lisää";
"commit" = "sitoudu";
"minutes" = "minuuttia";
"other" = "muu";
"revert" = "palauttaa";
"status" = "tilanne";
"terminal" = "terminaali";
"update" = "päivitys";

/* ==== UNLOCALIZED ==== */

"diff" = "diff";
"raw" = "raw";
"rm" = "rm";
